share/tutorials/incompressible/simple/rotor_disk/system/blockMeshDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      blockMeshDict;
}

backgroundMesh
{
  xMin      -1.26;
  xMax       1.26;
  yMin      -2.01;
  yMax       2.01;
  zMin      -1.26;
  zMax       1.26;
  xCells    12;
  yCells    22;
  zCells    12;
}
convertToMeters 1;
vertices
(
  ($:backgroundMesh.xMin $:backgroundMesh.yMin $:backgroundMesh.zMin)
  ($:backgroundMesh.xMax $:backgroundMesh.yMin $:backgroundMesh.zMin)
  ($:backgroundMesh.xMax $:backgroundMesh.yMax $:backgroundMesh.zMin)
  ($:backgroundMesh.xMin $:backgroundMesh.yMax $:backgroundMesh.zMin)
  ($:backgroundMesh.xMin $:backgroundMesh.yMin $:backgroundMesh.zMax)
  ($:backgroundMesh.xMax $:backgroundMesh.yMin $:backgroundMesh.zMax)
  ($:backgroundMesh.xMax $:backgroundMesh.yMax $:backgroundMesh.zMax)
  ($:backgroundMesh.xMin $:backgroundMesh.yMax $:backgroundMesh.zMax)
);
blocks
(
  hex (0 1 2 3 4 5 6 7)
  (
    $:backgroundMesh.xCells
    $:backgroundMesh.yCells
    $:backgroundMesh.zCells
  )
  simpleGrading (1 1 1)
);
edges
(
);
boundary
(
);
mergePatchPairs
(
);

// vim: set ft=foam et sw=2 ts=2 sts=2:
