share/tutorials/incompressible/simple/rotor_disk/0/U
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volVectorField;
  object      U;
}

Uinlet          (0 1 0);
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform $Uinlet;

boundaryField
{
  inlet
  {
    type            fixedValue;
    value           uniform $Uinlet;
  }
  outlet
  {
    type            pressureInletOutletVelocity;
    value           uniform $Uinlet;
  }
  "slip.*"
  {
    type            slip;
  }
  #includeEtc "case_dicts/setConstraintTypes"
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
