share/tutorials/incompressible/simple/rotor_disk/0/k
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      k;
}

kInlet          0.02;
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform $kInlet;

boundaryField
{
  inlet
  {
    type            fixedValue;
    value           uniform $kInlet;
  }
  outlet
  {
    type            inletOutlet;
    inletValue      uniform $kInlet;
    value           uniform $kInlet;
  }
  "slip.*"
  {
    type            slip;
  }
  #includeEtc "case_dicts/setConstraintTypes"
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
