share/tutorials/incompressible/simple/rotor_disk/system/fvSolution
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      fvSolution;
}

solvers
{
  p
  {
    solver          GAMG;
    smoother        GaussSeidel;
    cacheAgglomeration on;
    agglomerator    faceAreaPair;
    nCellsInCoarsestLevel 10;
    mergeLevels     1;
    tolerance       1e-6;
    relTol          0.1;
  }
  "(U|k|omega|epsilon)"
  {
    solver          smoothSolver;
    smoother        symGaussSeidel;
    tolerance       1e-6;
    relTol          0.1;
  }
}
SIMPLE
{
  nNonOrthogonalCorrectors 0;
  consistent      yes;
  residualControl
  {
    U                   1e-4;
    p                   1e-3;
    "(k|epsilon|omega)" 1e-3;
  }
}
relaxationFactors
{
  equations
  {
    U                   0.95;
    "(k|omega|epsilon)" 0.95;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
